app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors"  ORDER BY "authors"."id" ASC LIMIT 1
INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "bloop"], ["description", "bloopity"], ["author_id", 1], ["created_at", "2018-05-28 22:21:15.068212"], ["updated_at", "2018-05-28 22:21:15.068212"]]
---
  def create
    @author = Author.first
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.author_id = @author.id
    @post.save